app/views/patrons/index.html.erb


	<% unless bookmark.patrons.first.nil? %>
---
SELECT "patrons".* FROM "patrons" LIMIT 1