app/views/tag/_tagger.js.erb

SELECT tags.*, taggings.tags_count AS count FROM "tags" JOIN (SELECT taggings.tag_id, COUNT(taggings.tag_id) AS tags_count FROM "taggings" INNER JOIN bookmarks ON bookmarks.id = taggings.taggable_id WHERE (taggings.taggable_type = 'Bookmark' AND taggings.context = 'tags') AND (taggings.taggable_id IN(SELECT bookmarks.id FROM "bookmarks" )) GROUP BY taggings.tag_id HAVING COUNT(taggings.tag_id) > 0) AS taggings ON taggings.tag_id = tags.id
---
			// pretag click
			$("#cloud_"+myUUID+" a.pretag").click(
				function () {
					var arr = $("#tag_"+myUUID).val()=="" ? [] : $("#tag_"+myUUID).val().split(",");
					$.each(arr, function(i,item) {
						if (item.trim()=="") arr.splice(i,1);
					});
					arr.push($(this).text());
					$("#tag_"+myUUID).val(arr.join());
					$("#tag_"+myUUID).focus();
				}
			);