app/controllers/bookmarks_controller.rb

  def show
    @bookmark = Bookmark.find(params[:id])
---
SELECT "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."id" = ? LIMIT 1  [["id", "7"]]

  def edit
    @bookmark = Bookmark.find(params[:id])
---
SELECT "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."id" = ? LIMIT 1  [["id", "7"]]

  def create
    @bookmark = Bookmark.new(params[:bookmark])
    @bookmark.tag_list = params[:tags].tr(" ",",")

    if @bookmark.save
---
INSERT INTO "bookmarks" ("created_at", "original_url", "remote_ref", "title", "type", "updated_at", "uuid") VALUES (?, ?, ?, ?, ?, ?, ?)
INSERT INTO "tags" ("name") VALUES (?)  [["name", "san"]]