app/controllers/patrons_controller.rb

SELECT "patrons".* FROM "patrons" WHERE "patrons"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @patron = Patron.find(params[:id])

SELECT "patrons".* FROM "patrons" WHERE "patrons"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @patron = Patron.find(params[:id])