app/controllers/remote_controller.rb

INSERT INTO "bookmarks" ("created_at", "original_url", "remote_ref", "title", "type", "updated_at", "uuid") VALUES (?, ?, ?, ?, ?, ?, ?)  [["created_at", Tue, 17 Apr 2012 15:58:03 UTC +00:00], ["original_url", nil], ["remote_ref", nil], ["title", nil], ["type", nil], ["updated_at", Tue, 17 Apr 2012 15:58:03 UTC +00:00], ["uuid", nil]]
SELECT "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."original_url" = 'http://digitalgallery.nypl.org/nypldigital/index.cfm' LIMIT 1
---
  def create
    # FIXME: No kinds of validation at all.
    @bookmark = Bookmark.find_or_create_by_original_url(
      :original_url => params[:p],
      :title => params[:t]
    )

INSERT INTO "bookmarks" ("created_at", "original_url", "remote_ref", "title", "type", "updated_at", "uuid") VALUES (?, ?, ?, ?, ?, ?, ?)
INSERT INTO "tags" ("name") VALUES (?)  [["name", "nypl"]]
SELECT "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."original_url" = 'http://localhost:3000/' LIMIT 1
SELECT "tags".* FROM "tags" WHERE (name LIKE 'probando varias palabras' ESCAPE '!' OR name LIKE 'separadas por comas' ESCAPE '!' OR name LIKE 'una' ESCAPE '!' OR name LIKE 'dos' ESCAPE '!' OR name LIKE 'tres' ESCAPE '!')
---
  def service
    if params[:s]=="add"
      url = params[:u]
      title = params[:t]
      time = params[:i]
      tag_list = params[:a]
      if url != nil
        @bookmark = Bookmark.find_or_create_by_original_url(
          url, :title => title
        ){ |b| b.tag_list = tag_list }